tap "grishka/grishka"
tap "theboredteam/boring-notch"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Vector graphics library with cross-device output support
brew "cairo"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Framework for layout and rendering of i18n text
brew "pango"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Development kit for the Java programming language
brew "openjdk"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# C interface for Google's OS library for Machine Intelligence
brew "libtensorflow"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Reads arbitrary PDF files and generates an XML file readable by Ipe
brew "pdftoipe"
# General-purpose scripting language
brew "php"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tool for managing OCI containers and pods
brew "podman"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl3"
# Library for loading images as SDL surfaces and textures
brew "sdl3_image"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Audio utility
cask "background-music"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Open-source software for live streaming and screen recording
cask "obs"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Oracle SQLcl is the modern command-line interface for the Oracle Database
cask "sqlcl"
# Text editor for code, markup and prose
cask "sublime-text"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Wine wrapper built with SwiftUI
cask "whisky"
# Multiplayer code editor
cask "zed"
